package acad.prog.testnest;
/**
 * Task 2.12.3
 * @author Kolin Vyatkin
 * 1. Відкрийте проект TestNested з завдання 2-12-1.
 * 2. Створіть новий клас MyPhone.
 * 3. Перепишіть клас MyPhoneBook, зробивши його внутрішнім (нестатичним) класу MyPhone (перемістіть код
 * класу MyPhoneBook всередину класу MyPhone).
 * 4. Додайте до класу MyPhone конструктор без аргументів.
 * 5. Додайте до класу MyPhone загальнодоступний метод swichOn(), який друкує повідомлення "Завантаження
 * записів телефонної книги…" та створіть об’єкт MyPhoneBook і додайте до нього десять записів телефонних
 * номерів. В кінці роботи метод повине виводити на консоль "OK!";
 * 6. Додайте до класу MyPhone метод call(int index), який виводить на консоль повідомлення "Виклик: "
 * і повну інформацію з об'єкта MyPhoneBook, розташованого у масиві за індексом index.
 * 7. Додайте до методу main() код, який створює об’єкт MyPhone, викликає метод swichOn(), а потім викликає
 * метод call() зі значенням аргументу 1.
 * 8. Виконайте програму.
 * Приклад виведення програми:
 * Завантаження записів телефонної книги… OK!
 * Виклик: Ім'я: Борис, телефон: 0679878888
 * 9. Зазначте у документованому коментарі класів номер завдання, своє ім'я та прізвище.
 * 10. Надішліть викладачеві (до теми Java 12.10.2022 - IT Generation - Workshop Lesson 16) лістинги коду
 * програми та результат їх роботи.
 */
public class Main {

    public static void main(String[] args) {
        MyPhone phone = new MyPhone();
        phone.switchOn();
        phone.call(2);
    }
}